AUTO_config_TK_pesok/src/Catalogs/ТК_ХранилищеДанныхФорм/ТК_ХранилищеДанныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТК_ХранилищеДанныхФорм</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеФормы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/SettingsStorages/НайстройкиФорм/ManagerModule.bsl
Процедура ОбработкаЗагрузки(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь=Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_ХранилищеДанныхФорм.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТК_ХранилищеДанныхФорм КАК ТК_ХранилищеДанныхФорм
	|ГДЕ
	|	ТК_ХранилищеДанныхФорм.КлючОбъекта = &КлючОбъекта
	|	И ТК_ХранилищеДанныхФорм.Автор.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", Пользователи.НайтиПоИмени(Пользователь).ИдентификаторПользователяИБ);
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);

	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Настройки = Выборка.Ссылка.ДанныеФормы.Получить();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаСохранения(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь=Неопределено)
	
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_ХранилищеДанныхФорм.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТК_ХранилищеДанныхФорм КАК ТК_ХранилищеДанныхФорм
	|ГДЕ
	|	ТК_ХранилищеДанныхФорм.КлючОбъекта = &КлючОбъекта
	|	И ТК_ХранилищеДанныхФорм.Автор.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", Пользователи.НайтиПоИмени(Пользователь).ИдентификаторПользователяИБ);
	Запрос.УстановитьПараметр("КлючОбъекта", КлючОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СправочникОбъект = Справочники.ТК_ХранилищеДанныхФорм.СоздатьЭлемент();
		СправочникОбъект.Автор = Пользователи.ТекущийПользователь();
		СправочникОбъект.КлючОбъекта = КлючОбъекта;
		СправочникОбъект.Наименование = КлючНастроек;
	
	Иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	 СправочникОбъект.ДанныеФормы = Новый ХранилищеЗначения(Настройки,Новый СжатиеДанных());
	 СправочникОбъект.Записать();
	 УстановитьПривилегированныйРежим(Ложь);

	
КонецПроцедуры
